PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.h
/*******************************************************************************
*
* \file ifx_se_psacrypto.h
* \version 1.1.0
*
* \brief
*  This is the header file for the SE RT Services PSA crypto syscalls.
*
********************************************************************************
* \copyright
* Copyright 2022-2024, Cypress Semiconductor Corporation (an Infineon company).
* All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

/*******************************************************************************
* PSA crypto prototypes
****************************************************************************//**
*
* \defgroup psacrypto     IFX SE PSA crypto API
* \brief
*  This is the adopted version of PSA crypto API based on Mbed TLS
* \{
*   \defgroup hash_operations Hash operations
*       Hash operations definitions
*   \defgroup async_operations Signature and verification operations
*       Signature and verification operations definitions
*   \defgroup cipher_operations Cipher operations
*       Cipher operations definitions
*   \defgroup aead_operations AEAD operations
*       AEAD operations definitions
*   \defgroup mac_operations MAC operations
*       MAC operations definitions
*   \defgroup import_export Key import and export
*       Key import and export definitions
*   \defgroup key_derivation Key derivation
*       Key derivation definitions
*   \defgroup random Random generation
*       Random generation definitions
*   \defgroup crc32_calc CRC32 operations
*       CRC32 operations definitions
*   \defgroup key_attributes Key attributes operations
*       Key attributes operations definitions
*   \{
*       \defgroup crypto_types Key types
*           Key types operations definitions
*       \defgroup crypto_algs Key algorithms
*           Key algorithms operations definitions
*       \defgroup key_policy Key policies
*           Key policies operations definitions
*       \defgroup key_lifetimes Key lifetimes
*           Key lifetimes operations definitions
*       \defgroup builtin_keys Built-In keys
*           Built-In keys definitions
*   \}
*   \defgroup constants_sizes Data size definitions
*       Data size definitions
*   \defgroup psacrypto_error Error codes definitions
*       Error codes definitions
* \}
*
*******************************************************************************/

#ifndef IFX_SE_PSACRYPTO_H
#define IFX_SE_PSACRYPTO_H

#include <stddef.h>
#include <stdint.h>

#include "ifx_se_fih.h"

/** This type represents open handles to keys.
 * 0 is not a valid key handle. How other handle values are assigned is
 * implementation-dependent.
 * */
typedef uint32_t ifx_se_key_handle_t;

#ifdef __cplusplus
extern "C" {
#endif

/* The file "crypto_types.h" declares types that encode errors,
 * algorithms, key types, policies, etc. */
#include "ifx_se_psacrypto_types.h"

/* The file "crypto_values.h" declares macros to build and analyze values
 * of integral types defined in "crypto_types.h". */
#include "ifx_se_psacrypto_values.h"

/* The file "crypto_struct.h" contains definitions for
 * implementation-specific structs that are declared above. */
#include "ifx_se_psacrypto_struct.h"

/* The file "crypto_sizes.h" contains definitions for size calculation
 * macros whose definitions are implementation-specific. */
#include "ifx_se_psacrypto_sizes.h"

#include "ifx_se_syscall.h"

/** \addtogroup async_operations
 * \{
 */

/**
 * \brief Sign a hash or short message with a private key.
 *
 * Note that to perform a hash-and-sign signature algorithm, you must
 * first calculate the hash by calling ifx_se_hash_setup(), ifx_se_hash_update()
 * and ifx_se_hash_finish(), or alternatively by calling ifx_se_hash_compute().
 * Then pass the resulting hash as the \p hash
 * parameter to this function. You can use #IFX_SE_ALG_SIGN_GET_HASH(\p alg)
 * to determine the hash algorithm to use.
 *
 * \param[in] key               Identifier of the key to use for the operation.
 *                              It must be an asymmetric key pair. The key must
 *                              allow the usage #IFX_SE_KEY_USAGE_SIGN_HASH.
 * \param[in] alg               A signature algorithm (IFX_SE_ALG_XXX
 *                              value such that #IFX_SE_ALG_IS_SIGN_HASH(\p alg)
 *                              is true), that is compatible with
 *                              the type of \p key.
 * \param[in] hash              The hash or message to sign.
 * \param[in] hash_length       Size of the \p hash buffer in bytes.
 * \param[out] signature        Buffer where the signature is to be written.
 * \param[in] signature_size    Size of the \p signature buffer in bytes.
 * \param[out] signature_length On success, the number of bytes
 *                              that make up the returned signature value.
 * \param[in] ctx               The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_BUFFER_TOO_SMALL
 *         The size of the \p signature buffer is too small. You can
 *         determine a sufficient buffer size by calling
 *         #IFX_SE_SIGN_OUTPUT_SIZE(\c key_type, \c key_bits, \p alg)
 *         where \c key_type and \c key_bits are the type and bit-size
 *         respectively of \p key.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_INSUFFICIENT_ENTROPY
 */
ifx_se_status_t ifx_se_sign_hash(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t hash,
    ifx_se_fih_t hash_length,
    const ifx_se_fih_ptr_t signature,
    ifx_se_fih_t signature_size,
    ifx_se_fih_ptr_t signature_length,
    void *ctx);

/**
 * \brief Verify the signature of a hash or short message using a public key.
 *
 * Note that to perform a hash-and-sign signature algorithm, you must
 * first calculate the hash by calling ifx_se_hash_setup(), ifx_se_hash_update()
 * and ifx_se_hash_finish(), or alternatively by calling ifx_se_hash_compute().
 * Then pass the resulting hash as the \p hash
 * parameter to this function. You can use #IFX_SE_ALG_SIGN_GET_HASH(\p alg)
 * to determine the hash algorithm to use.
 *
 * \param[in] key               Identifier of the key to use for the operation.
 *                              It must be a public key or an asymmetric key
 *                              pair. The key must allow the usage
 *                              #IFX_SE_KEY_USAGE_VERIFY_HASH.
 * \param[in] alg               A signature algorithm (IFX_SE_ALG_XXX
 *                              value such that #IFX_SE_ALG_IS_SIGN_HASH(\p alg)
 *                              is true), that is compatible with
 *                              the type of \p key.
 * \param[in] hash              The hash or message whose signature is to be
 *                              verified.
 * \param[in] hash_length       Size of the \p hash buffer in bytes.
 * \param[in] signature         Buffer containing the signature to verify.
 * \param[in] signature_length  Size of the \p signature buffer in bytes.
 * \param[in] ctx               The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         The signature is valid.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_INVALID_SIGNATURE
 *         The calculation was performed successfully, but the passed
 *         signature is not a valid signature.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 */
ifx_se_status_t ifx_se_verify_hash(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t hash,
    ifx_se_fih_t hash_length,
    const ifx_se_fih_ptr_t signature,
    ifx_se_fih_t signature_length,
    void *ctx);

/**
 * \brief Sign a message with a private key. For hash-and-sign algorithms,
 *        this includes the hashing step.
 *
 * \note To perform a multi-part hash-and-sign signature algorithm, first use
 *       a multi-part hash operation and then pass the resulting hash to
 *       ifx_se_sign_hash(). IFX_SE_ALG_GET_HASH(\p alg) can be used to determine the
 *       hash algorithm to use.
 *
 * \param[in]  key              Identifier of the key to use for the operation.
 *                              It must be an asymmetric key pair. The key must
 *                              allow the usage #IFX_SE_KEY_USAGE_SIGN_MESSAGE.
 * \param[in]  alg              An asymmetric signature algorithm (IFX_SE_ALG_XXX
 *                              value such that #IFX_SE_ALG_IS_SIGN_MESSAGE(\p alg)
 *                              is true), that is compatible with the type of
 *                              \p key.
 * \param[in]  input            The input message to sign.
 * \param[in]  input_length     Size of the \p input buffer in bytes.
 * \param[out] signature        Buffer where the signature is to be written.
 * \param[in]  signature_size   Size of the \p signature buffer in bytes. This
 *                              must be appropriate for the selected
 *                              algorithm and key:
 *                              - The required signature size is
 *                                #IFX_SE_SIGN_OUTPUT_SIZE(\c key_type, \c key_bits, \p alg)
 *                                where \c key_type and \c key_bits are the type and
 *                                bit-size respectively of key.
 *                              - #IFX_SE_SIGNATURE_MAX_SIZE evaluates to the
 *                                maximum signature size of any supported
 *                                signature algorithm.
 * \param[out] signature_length On success, the number of bytes that make up
 *                              the returned signature value.
 * \param[in] ctx               The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 *         The key does not have the #IFX_SE_KEY_USAGE_SIGN_MESSAGE flag,
 *         or it does not permit the requested algorithm.
 * \retval #IFX_SE_ERROR_BUFFER_TOO_SMALL
 *         The size of the \p signature buffer is too small. You can
 *         determine a sufficient buffer size by calling
 *         #IFX_SE_SIGN_OUTPUT_SIZE(\c key_type, \c key_bits, \p alg)
 *         where \c key_type and \c key_bits are the type and bit-size
 *         respectively of \p key.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_DATA_CORRUPT
 * \retval #IFX_SE_ERROR_DATA_INVALID
 * \retval #IFX_SE_ERROR_INSUFFICIENT_ENTROPY
 */
ifx_se_status_t ifx_se_sign_message(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t input,
    ifx_se_fih_t input_length,
    ifx_se_fih_ptr_t signature,
    ifx_se_fih_t signature_size,
    ifx_se_fih_ptr_t signature_length,
    void *ctx);

/** \brief Verify the signature of a message with a public key, using
 *         a hash-and-sign verification algorithm.
 *
 * \note To perform a multi-part hash-and-sign signature verification
 *       algorithm, first use a multi-part hash operation to hash the message
 *       and then pass the resulting hash to ifx_se_verify_hash().
 *       IFX_SE_ALG_GET_HASH(\p alg) can be used to determine the hash algorithm
 *       to use.
 *
 * \param[in]  key              Identifier of the key to use for the operation.
 *                              It must be a public key or an asymmetric key
 *                              pair. The key must allow the usage
 *                              #IFX_SE_KEY_USAGE_VERIFY_MESSAGE.
 * \param[in]  alg              An asymmetric signature algorithm (IFX_SE_ALG_XXX
 *                              value such that #IFX_SE_ALG_IS_SIGN_MESSAGE(\p alg)
 *                              is true), that is compatible with the type of
 *                              \p key.
 * \param[in]  input            The message whose signature is to be verified.
 * \param[in]  input_length     Size of the \p input buffer in bytes.
 * \param[out] signature        Buffer containing the signature to verify.
 * \param[in]  signature_length Size of the \p signature buffer in bytes.
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 * \retval #IFX_SE_SUCCESS
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 *         The key does not have the #IFX_SE_KEY_USAGE_SIGN_MESSAGE flag,
 *         or it does not permit the requested algorithm.
 * \retval #IFX_SE_ERROR_INVALID_SIGNATURE
 *         The calculation was performed successfully, but the passed signature
 *         is not a valid signature.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_DATA_CORRUPT
 * \retval #IFX_SE_ERROR_DATA_INVALID
 */
ifx_se_status_t ifx_se_verify_message(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t input,
    ifx_se_fih_t input_length,
    const ifx_se_fih_ptr_t signature,
    ifx_se_fih_t signature_length,
    void *ctx);

