PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.h
/** \} */


/** \addtogroup aead_operations
 * \{
 */

/** Process an authenticated encryption operation.
 *
 * \param[in] key                 Identifier of the key to use for the
 *                                operation. It must allow the usage
 *                                #IFX_SE_KEY_USAGE_ENCRYPT.
 * \param[in] alg                 The AEAD algorithm to compute
 *                                (\c IFX_SE_ALG_XXX value such that
 *                                #IFX_SE_ALG_IS_AEAD(\p alg) is true).
 * \param[in] nonce               Nonce or IV to use.
 * \param[in] nonce_length        Size of the \p nonce buffer in bytes.
 * \param[in] additional_data     Additional data that will be authenticated
 *                                but not encrypted.
 * \param[in] additional_data_length  Size of \p additional_data in bytes.
 * \param[in] plaintext           Data that will be authenticated and
 *                                encrypted.
 * \param[in] plaintext_length    Size of \p plaintext in bytes.
 * \param[out] ciphertext         Output buffer for the authenticated and
 *                                encrypted data. The additional data is not
 *                                part of this output. For algorithms where the
 *                                encrypted data and the authentication tag
 *                                are defined as separate outputs, the
 *                                authentication tag is appended to the
 *                                encrypted data.
 * \param[in] ciphertext_size     Size of the \p ciphertext buffer in bytes.
 *                                This must be appropriate for the selected
 *                                algorithm and key:
 *                                - A sufficient output size is
 *                                  #IFX_SE_AEAD_ENCRYPT_OUTPUT_SIZE(\c key_type,
 *                                  \p alg, \p plaintext_length) where
 *                                  \c key_type is the type of \p key.
 *                                - #IFX_SE_AEAD_ENCRYPT_OUTPUT_MAX_SIZE(\p
 *                                  plaintext_length) evaluates to the maximum
 *                                  ciphertext size of any supported AEAD
 *                                  encryption.
 * \param[out] ciphertext_length  On success, the size of the output
 *                                in the \p ciphertext buffer.
 * \param[in]  ctx                The pointer to the SE syscall context that
 *                                contain a special syscall data
 *                                (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \p key is not compatible with \p alg.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 *         \p alg is not supported or is not an AEAD algorithm.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_BUFFER_TOO_SMALL
 *         \p ciphertext_size is too small.
 *         #IFX_SE_AEAD_ENCRYPT_OUTPUT_SIZE(\c key_type, \p alg,
 *         \p plaintext_length) or
 *         #IFX_SE_AEAD_ENCRYPT_OUTPUT_MAX_SIZE(\p plaintext_length) can be used to
 *         determine the required buffer size.
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 */
ifx_se_status_t ifx_se_aead_encrypt(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t nonce,
    ifx_se_fih_t nonce_length,
    const ifx_se_fih_ptr_t additional_data,
    ifx_se_fih_t additional_data_length,
    const ifx_se_fih_ptr_t plaintext,
    ifx_se_fih_t plaintext_length,
    const ifx_se_fih_ptr_t ciphertext,
    ifx_se_fih_t ciphertext_size,
    ifx_se_fih_ptr_t ciphertext_length,
    void *ctx);

/** Process an authenticated decryption operation.
 *
 * \param[in] key                 Identifier of the key to use for the
 *                                operation. It must allow the usage
 *                                #IFX_SE_KEY_USAGE_DECRYPT.
 * \param[in] alg                 The AEAD algorithm to compute
 *                                (\c IFX_SE_ALG_XXX value such that
 *                                #IFX_SE_ALG_IS_AEAD(\p alg) is true).
 * \param[in] nonce               Nonce or IV to use.
 * \param[in] nonce_length        Size of the \p nonce buffer in bytes.
 * \param[in] additional_data     Additional data that has been authenticated
 *                                but not encrypted.
 * \param[in] additional_data_length  Size of \p additional_data in bytes.
 * \param[in] ciphertext          Data that has been authenticated and
 *                                encrypted. For algorithms where the
 *                                encrypted data and the authentication tag
 *                                are defined as separate inputs, the buffer
 *                                must contain the encrypted data followed
 *                                by the authentication tag.
 * \param[in] ciphertext_length   Size of \p ciphertext in bytes.
 * \param[out] plaintext          Output buffer for the decrypted data.
 * \param[in] plaintext_size      Size of the \p plaintext buffer in bytes.
 *                                This must be appropriate for the selected
 *                                algorithm and key:
 *                                - A sufficient output size is
 *                                  #IFX_SE_AEAD_DECRYPT_OUTPUT_SIZE(\c key_type,
 *                                  \p alg, \p ciphertext_length) where
 *                                  \c key_type is the type of \p key.
 *                                - #IFX_SE_AEAD_DECRYPT_OUTPUT_MAX_SIZE(\p
 *                                  ciphertext_length) evaluates to the maximum
 *                                  plaintext size of any supported AEAD
 *                                  decryption.
 * \param[out] plaintext_length   On success, the size of the output
 *                                in the \p plaintext buffer.
 * \param[in] ctx                 The pointer to the SE syscall context that
 *                                contain a special syscall data
 *                                (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_INVALID_SIGNATURE
 *         The ciphertext is not authentic.
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \p key is not compatible with \p alg.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 *         \p alg is not supported or is not an AEAD algorithm.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_BUFFER_TOO_SMALL
 *         \p plaintext_size is too small.
 *         #IFX_SE_AEAD_DECRYPT_OUTPUT_SIZE(\c key_type, \p alg,
 *         \p ciphertext_length) or
 *         #IFX_SE_AEAD_DECRYPT_OUTPUT_MAX_SIZE(\p ciphertext_length) can be used
 *         to determine the required buffer size.
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 */
ifx_se_status_t ifx_se_aead_decrypt(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t nonce,
    ifx_se_fih_t nonce_length,
    const ifx_se_fih_ptr_t additional_data,
    ifx_se_fih_t additional_data_length,
    const ifx_se_fih_ptr_t ciphertext,
    ifx_se_fih_t ciphertext_length,
    const ifx_se_fih_ptr_t plaintext,
    ifx_se_fih_t plaintext_size,
    ifx_se_fih_ptr_t plaintext_length,
    void *ctx);

/** Set the key for a multipart authenticated encryption operation.
 *
 * The sequence of operations to encrypt a message with authentication
 * is as follows:
 * -# Allocate an operation object which will be passed to all the functions
 *    listed here.
 * -# Initialize the operation object with one of the methods described in the
 *    documentation for #ifx_se_aead_operation_t, e.g.
 *    #IFX_SE_AEAD_OPERATION_INIT.
 * -# Call ifx_se_aead_encrypt_setup() to specify the algorithm and key.
 * -# If needed, call ifx_se_aead_set_lengths() to specify the length of the
 *    inputs to the subsequent calls to ifx_se_aead_update_ad() and
 *    ifx_se_aead_update(). See the documentation of ifx_se_aead_set_lengths()
 *    for details.
 * -# Call either ifx_se_aead_generate_nonce() or ifx_se_aead_set_nonce() to
 *    generate or set the nonce. You should use
 *    ifx_se_aead_generate_nonce() unless the protocol you are implementing
 *    requires a specific nonce value.
 * -# Call ifx_se_aead_update_ad() zero, one or more times, passing a fragment
 *    of the non-encrypted additional authenticated data each time.
 * -# Call ifx_se_aead_update() zero, one or more times, passing a fragment
 *    of the message to encrypt each time.
 * -# Call ifx_se_aead_finish().
 *
 * If an error occurs at any step after a call to ifx_se_aead_encrypt_setup(),
 * the operation will need to be reset by a call to ifx_se_aead_abort(). The
 * application may call ifx_se_aead_abort() at any time after the operation
 * has been initialized.
 *
 * After a successful call to ifx_se_aead_encrypt_setup(), the application must
 * eventually terminate the operation. The following events terminate an
 * operation:
 * - A successful call to ifx_se_aead_finish().
 * - A call to ifx_se_aead_abort().
 *
 * \param[in,out] operation     The operation object to set up. It must have
 *                              been initialized as per the documentation for
 *                              #ifx_se_aead_operation_t and not yet in use.
 * \param[in] key            Identifier of the key to use for the operation.
 *                              It must remain valid until the operation
 *                              terminates. It must allow the usage
 *                              #IFX_SE_KEY_USAGE_ENCRYPT.
 * \param[in] alg               The AEAD algorithm to compute
 *                              (\c IFX_SE_ALG_XXX value such that
 *                              #IFX_SE_ALG_IS_AEAD(\p alg) is true).
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be inactive), or
 *         the library has not been previously initialized by ifx_se_crypto_init().
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \p key is not compatible with \p alg.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 *         \p alg is not supported or is not an AEAD algorithm.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 */
ifx_se_status_t ifx_se_aead_encrypt_setup(
    ifx_se_aead_operation_t *operation,
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    void *ctx);

