PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.h
/** Set the key for a multipart authenticated decryption operation.
 *
 * The sequence of operations to decrypt a message with authentication
 * is as follows:
 * -# Allocate an operation object which will be passed to all the functions
 *    listed here.
 * -# Initialize the operation object with one of the methods described in the
 *    documentation for #ifx_se_aead_operation_t, e.g.
 *    #IFX_SE_AEAD_OPERATION_INIT.
 * -# Call ifx_se_aead_decrypt_setup() to specify the algorithm and key.
 * -# If needed, call ifx_se_aead_set_lengths() to specify the length of the
 *    inputs to the subsequent calls to ifx_se_aead_update_ad() and
 *    ifx_se_aead_update(). See the documentation of ifx_se_aead_set_lengths()
 *    for details.
 * -# Call ifx_se_aead_set_nonce() with the nonce for the decryption.
 * -# Call ifx_se_aead_update_ad() zero, one or more times, passing a fragment
 *    of the non-encrypted additional authenticated data each time.
 * -# Call ifx_se_aead_update() zero, one or more times, passing a fragment
 *    of the ciphertext to decrypt each time.
 * -# Call ifx_se_aead_verify().
 *
 * If an error occurs at any step after a call to ifx_se_aead_decrypt_setup(),
 * the operation will need to be reset by a call to ifx_se_aead_abort(). The
 * application may call ifx_se_aead_abort() at any time after the operation
 * has been initialized.
 *
 * After a successful call to ifx_se_aead_decrypt_setup(), the application must
 * eventually terminate the operation. The following events terminate an
 * operation:
 * - A successful call to ifx_se_aead_verify().
 * - A call to ifx_se_aead_abort().
 *
 * \param[in,out] operation     The operation object to set up. It must have
 *                              been initialized as per the documentation for
 *                              #ifx_se_aead_operation_t and not yet in use.
 * \param[in] key               Identifier of the key to use for the operation.
 *                              It must remain valid until the operation
 *                              terminates. It must allow the usage
 *                              #IFX_SE_KEY_USAGE_DECRYPT.
 * \param[in] alg               The AEAD algorithm to compute
 *                              (\c IFX_SE_ALG_XXX value such that
 *                              #IFX_SE_ALG_IS_AEAD(\p alg) is true).
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \p key is not compatible with \p alg.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 *         \p alg is not supported or is not an AEAD algorithm.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 */
ifx_se_status_t ifx_se_aead_decrypt_setup(
    ifx_se_aead_operation_t *operation,
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    void *ctx);

/** Generate a random nonce for an authenticated encryption operation.
 *
 * This function generates a random nonce for the authenticated encryption
 * operation with an appropriate size for the chosen algorithm, key type
 * and key size.
 *
 * The application must call ifx_se_aead_encrypt_setup() before
 * calling this function.
 *
 * If this function returns an error status, the operation enters an error
 * state and must be aborted by calling ifx_se_aead_abort().
 *
 * \param[in,out] operation     Active AEAD operation.
 * \param[out] nonce            Buffer where the generated nonce is to be
 *                              written.
 * \param[in] nonce_size        Size of the \p nonce buffer in bytes.
 * \param[out] nonce_length     On success, the number of bytes of the
 *                              generated nonce.
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_BUFFER_TOO_SMALL
 *         The size of the \p nonce buffer is too small.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be an active aead encrypt
 *         operation, with no nonce set).
 */
ifx_se_status_t ifx_se_aead_generate_nonce(
    ifx_se_aead_operation_t *operation,
    ifx_se_fih_ptr_t nonce,
    ifx_se_fih_t nonce_size,
    ifx_se_fih_ptr_t nonce_length,
    void *ctx);

/** Set the nonce for an authenticated encryption or decryption operation.
 *
 * This function sets the nonce for the authenticated
 * encryption or decryption operation.
 *
 * The application must call ifx_se_aead_encrypt_setup() or
 * ifx_se_aead_decrypt_setup() before calling this function.
 *
 * If this function returns an error status, the operation enters an error
 * state and must be aborted by calling ifx_se_aead_abort().
 *
 * \note When encrypting, applications should use ifx_se_aead_generate_nonce()
 * instead of this function, unless implementing a protocol that requires
 * a non-random IV.
 *
 * \param[in,out] operation     Active AEAD operation.
 * \param[in] nonce             Buffer containing the nonce to use.
 * \param[in] nonce_length      Size of the nonce in bytes.
 * \param[in] ctx               The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         The size of \p nonce is not acceptable for the chosen algorithm.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be active, with no nonce
 *         set).
 */
ifx_se_status_t ifx_se_aead_set_nonce(
    ifx_se_aead_operation_t *operation,
    const ifx_se_fih_ptr_t nonce,
    ifx_se_fih_t nonce_length,
    void *ctx);

