PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.h
/** Declare the lengths of the message and additional data for AEAD.
 *
 * The application must call this function before calling
 * ifx_se_aead_update_ad() or ifx_se_aead_update() if the algorithm for
 * the operation requires it. If the algorithm does not require it,
 * calling this function is optional, but if this function is called
 * then the implementation must enforce the lengths.
 *
 * You may call this function before or after setting the nonce with
 * ifx_se_aead_set_nonce() or ifx_se_aead_generate_nonce().
 *
 * - For #IFX_SE_ALG_CCM, calling this function is required.
 * - For the other AEAD algorithms defined in this specification, calling
 *   this function is not required.
 * - For vendor-defined algorithm, refer to the vendor documentation.
 *
 * If this function returns an error status, the operation enters an error
 * state and must be aborted by calling ifx_se_aead_abort().
 *
 * \param[in,out] operation     Active AEAD operation.
 * \param[in] ad_length         Size of the non-encrypted additional
 *                              authenticated data in bytes.
 * \param[in] plaintext_length  Size of the plaintext to encrypt in bytes.
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         At least one of the lengths is not acceptable for the chosen
 *         algorithm.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be active, and
 *         ifx_se_aead_update_ad() and ifx_se_aead_update() must not have been
 *         called yet).
 */
ifx_se_status_t ifx_se_aead_set_lengths(
    ifx_se_aead_operation_t *operation,
    ifx_se_fih_t ad_length,
    ifx_se_fih_t plaintext_length,
    void *ctx);

/** Pass additional data to an active AEAD operation.
 *
 * Additional data is authenticated, but not encrypted.
 *
 * You may call this function multiple times to pass successive fragments
 * of the additional data. You may not call this function after passing
 * data to encrypt or decrypt with ifx_se_aead_update().
 *
 * Before calling this function, you must:
 * 1. Call either ifx_se_aead_encrypt_setup() or ifx_se_aead_decrypt_setup().
 * 2. Set the nonce with ifx_se_aead_generate_nonce() or ifx_se_aead_set_nonce().
 *
 * If this function returns an error status, the operation enters an error
 * state and must be aborted by calling ifx_se_aead_abort().
 *
 * \warning When decrypting, until ifx_se_aead_verify() has returned #IFX_SE_SUCCESS,
 *          there is no guarantee that the input is valid. Therefore, until
 *          you have called ifx_se_aead_verify() and it has returned #IFX_SE_SUCCESS,
 *          treat the input as untrusted and prepare to undo any action that
 *          depends on the input if ifx_se_aead_verify() returns an error status.
 *
 * \param[in,out] operation     Active AEAD operation.
 * \param[in] input             Buffer containing the fragment of
 *                              additional data.
 * \param[in] input_length      Size of the \p input buffer in bytes.
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         The total input length overflows the additional data length that
 *         was previously specified with ifx_se_aead_set_lengths().
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be active, have a nonce
 *         set, have lengths set if required by the algorithm, and
 *         ifx_se_aead_update() must not have been called yet).
 */
ifx_se_status_t ifx_se_aead_update_ad(
    ifx_se_aead_operation_t *operation,
    const ifx_se_fih_ptr_t input,
    ifx_se_fih_t input_length,
    void *ctx);

/** Encrypt or decrypt a message fragment in an active AEAD operation.
 *
 * Before calling this function, you must:
 * 1. Call either ifx_se_aead_encrypt_setup() or ifx_se_aead_decrypt_setup().
 *    The choice of setup function determines whether this function
 *    encrypts or decrypts its input.
 * 2. Set the nonce with ifx_se_aead_generate_nonce() or ifx_se_aead_set_nonce().
 * 3. Call ifx_se_aead_update_ad() to pass all the additional data.
 *
 * If this function returns an error status, the operation enters an error
 * state and must be aborted by calling ifx_se_aead_abort().
 *
 * \warning When decrypting, until ifx_se_aead_verify() has returned #IFX_SE_SUCCESS,
 *          there is no guarantee that the input is valid. Therefore, until
 *          you have called ifx_se_aead_verify() and it has returned #IFX_SE_SUCCESS:
 *          - Do not use the output in any way other than storing it in a
 *            confidential location. If you take any action that depends
 *            on the tentative decrypted data, this action will need to be
 *            undone if the input turns out not to be valid. Furthermore,
 *            if an adversary can observe that this action took place
 *            (for example through timing), they may be able to use this
 *            fact as an oracle to decrypt any message encrypted with the
 *            same key.
 *          - In particular, do not copy the output anywhere but to a
 *            memory or storage space that you have exclusive access to.
 *
 * This function does not require the input to be aligned to any
 * particular block boundary. If the implementation can only process
 * a whole block at a time, it must consume all the input provided, but
 * it may delay the end of the corresponding output until a subsequent
 * call to ifx_se_aead_update(), ifx_se_aead_finish() or ifx_se_aead_verify()
 * provides sufficient input. The amount of data that can be delayed
 * in this way is bounded by #IFX_SE_AEAD_UPDATE_OUTPUT_SIZE.
 *
 * \param[in,out] operation     Active AEAD operation.
 * \param[in] input             Buffer containing the message fragment to
 *                              encrypt or decrypt.
 * \param[in] input_length      Size of the \p input buffer in bytes.
 * \param[out] output           Buffer where the output is to be written.
 * \param[in] output_size       Size of the \p output buffer in bytes.
 *                              This must be appropriate for the selected
 *                                algorithm and key:
 *                                - A sufficient output size is
 *                                  #IFX_SE_AEAD_UPDATE_OUTPUT_SIZE(\c key_type,
 *                                  \c alg, \p input_length) where
 *                                  \c key_type is the type of key and \c alg is
 *                                  the algorithm that were used to set up the
 *                                  operation.
 *                                - #IFX_SE_AEAD_UPDATE_OUTPUT_MAX_SIZE(\p
 *                                  input_length) evaluates to the maximum
 *                                  output size of any supported AEAD
 *                                  algorithm.
 * \param[out] output_length    On success, the number of bytes
 *                              that make up the returned output.
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_BUFFER_TOO_SMALL
 *         The size of the \p output buffer is too small.
 *         #IFX_SE_AEAD_UPDATE_OUTPUT_SIZE(\c key_type, \c alg, \p input_length) or
 *         #IFX_SE_AEAD_UPDATE_OUTPUT_MAX_SIZE(\p input_length) can be used to
 *         determine the required buffer size.
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         The total length of input to ifx_se_aead_update_ad() so far is
 *         less than the additional data length that was previously
 *         specified with ifx_se_aead_set_lengths(), or
 *         the total input length overflows the plaintext length that
 *         was previously specified with ifx_se_aead_set_lengths().
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be active, have a nonce
 *         set, and have lengths set if required by the algorithm).
 */
ifx_se_status_t ifx_se_aead_update(
    ifx_se_aead_operation_t *operation,
    const ifx_se_fih_ptr_t input,
    ifx_se_fih_t input_length,
    ifx_se_fih_ptr_t output,
    ifx_se_fih_t output_size,
    ifx_se_fih_ptr_t output_length,
    void *ctx);

/** Finish encrypting a message in an AEAD operation.
 *
 * The operation must have been set up with ifx_se_aead_encrypt_setup().
 *
 * This function finishes the authentication of the additional data
 * formed by concatenating the inputs passed to preceding calls to
 * ifx_se_aead_update_ad() with the plaintext formed by concatenating the
 * inputs passed to preceding calls to ifx_se_aead_update().
 *
 * This function has two output buffers:
 * - \p ciphertext contains trailing ciphertext that was buffered from
 *   preceding calls to ifx_se_aead_update().
 * - \p tag contains the authentication tag.
 *
 * When this function returns successfully, the operation becomes inactive.
 * If this function returns an error status, the operation enters an error
 * state and must be aborted by calling ifx_se_aead_abort().
 *
 * \param[in,out] operation     Active AEAD operation.
 * \param[out] ciphertext       Buffer where the last part of the ciphertext
 *                              is to be written.
 * \param[in] ciphertext_size   Size of the \p ciphertext buffer in bytes.
 *                              This must be appropriate for the selected
 *                              algorithm and key:
 *                              - A sufficient output size is
 *                                #IFX_SE_AEAD_FINISH_OUTPUT_SIZE(\c key_type,
 *                                \c alg) where \c key_type is the type of key
 *                                and \c alg is the algorithm that were used to
 *                                set up the operation.
 *                              - #IFX_SE_AEAD_FINISH_OUTPUT_MAX_SIZE evaluates to
 *                                the maximum output size of any supported AEAD
 *                                algorithm.
 * \param[out] ciphertext_length On success, the number of bytes of
 *                              returned ciphertext.
 * \param[out] tag              Buffer where the authentication tag is
 *                              to be written.
 * \param[in] tag_size          Size of the \p tag buffer in bytes.
 *                              This must be appropriate for the selected
 *                              algorithm and key:
 *                              - The exact tag size is #IFX_SE_AEAD_TAG_LENGTH(\c
 *                                key_type, \c key_bits, \c alg) where
 *                                \c key_type and \c key_bits are the type and
 *                                bit-size of the key, and \c alg is the
 *                                algorithm that were used in the call to
 *                                ifx_se_aead_encrypt_setup().
 *                              - #IFX_SE_AEAD_TAG_MAX_SIZE evaluates to the
 *                                maximum tag size of any supported AEAD
 *                                algorithm.
 * \param[out] tag_length       On success, the number of bytes
 *                              that make up the returned tag.
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_BUFFER_TOO_SMALL
 *         The size of the \p ciphertext or \p tag buffer is too small.
 *         #IFX_SE_AEAD_FINISH_OUTPUT_SIZE(\c key_type, \c alg) or
 *         #IFX_SE_AEAD_FINISH_OUTPUT_MAX_SIZE can be used to determine the
 *         required \p ciphertext buffer size. #IFX_SE_AEAD_TAG_LENGTH(\c key_type,
 *         \c key_bits, \c alg) or #IFX_SE_AEAD_TAG_MAX_SIZE can be used to
 *         determine the required \p tag buffer size.
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         The total length of input to ifx_se_aead_update_ad() so far is
 *         less than the additional data length that was previously
 *         specified with ifx_se_aead_set_lengths(), or
 *         the total length of input to ifx_se_aead_update() so far is
 *         less than the plaintext length that was previously
 *         specified with ifx_se_aead_set_lengths().
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be an active encryption
 *         operation with a nonce set).
 */
ifx_se_status_t ifx_se_aead_finish(
    ifx_se_aead_operation_t *operation,
    ifx_se_fih_ptr_t ciphertext,
    ifx_se_fih_t ciphertext_size,
    ifx_se_fih_ptr_t ciphertext_length,
    ifx_se_fih_ptr_t tag,
    ifx_se_fih_t tag_size,
    ifx_se_fih_ptr_t tag_length,
    void *ctx);

/** Finish authenticating and decrypting a message in an AEAD operation.
 *
 * The operation must have been set up with ifx_se_aead_decrypt_setup().
 *
 * This function finishes the authenticated decryption of the message
 * components:
 *
 * -  The additional data consisting of the concatenation of the inputs
 *    passed to preceding calls to ifx_se_aead_update_ad().
 * -  The ciphertext consisting of the concatenation of the inputs passed to
 *    preceding calls to ifx_se_aead_update().
 * -  The tag passed to this function call.
 *
 * If the authentication tag is correct, this function outputs any remaining
 * plaintext and reports success. If the authentication tag is not correct,
 * this function returns #IFX_SE_ERROR_INVALID_SIGNATURE.
 *
 * When this function returns successfully, the operation becomes inactive.
 * If this function returns an error status, the operation enters an error
 * state and must be aborted by calling ifx_se_aead_abort().
 *
 * \note Implementations shall make the best effort to ensure that the
 * comparison between the actual tag and the expected tag is performed
 * in constant time.
 *
 * \param[in,out] operation     Active AEAD operation.
 * \param[out] plaintext        Buffer where the last part of the plaintext
 *                              is to be written. This is the remaining data
 *                              from previous calls to ifx_se_aead_update()
 *                              that could not be processed until the end
 *                              of the input.
 * \param[in] plaintext_size    Size of the \p plaintext buffer in bytes.
 *                              This must be appropriate for the selected algorithm and key:
 *                              - A sufficient output size is
 *                                #IFX_SE_AEAD_VERIFY_OUTPUT_SIZE(\c key_type,
 *                                \c alg) where \c key_type is the type of key
 *                                and \c alg is the algorithm that were used to
 *                                set up the operation.
 *                              - #IFX_SE_AEAD_VERIFY_OUTPUT_MAX_SIZE evaluates to
 *                                the maximum output size of any supported AEAD
 *                                algorithm.
 * \param[out] plaintext_length On success, the number of bytes of
 *                              returned plaintext.
 * \param[in] tag               Buffer containing the authentication tag.
 * \param[in] tag_length        Size of the \p tag buffer in bytes.
 * \param[in] ctx               The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_SIGNATURE
 *         The calculations were successful, but the authentication tag is
 *         not correct.
 * \retval #IFX_SE_ERROR_BUFFER_TOO_SMALL
 *         The size of the \p plaintext buffer is too small.
 *         #IFX_SE_AEAD_VERIFY_OUTPUT_SIZE(\c key_type, \c alg) or
 *         #IFX_SE_AEAD_VERIFY_OUTPUT_MAX_SIZE can be used to determine the
 *         required buffer size.
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         The total length of input to ifx_se_aead_update_ad() so far is
 *         less than the additional data length that was previously
 *         specified with ifx_se_aead_set_lengths(), or
 *         the total length of input to ifx_se_aead_update() so far is
 *         less than the plaintext length that was previously
 *         specified with ifx_se_aead_set_lengths().
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be an active decryption
 *         operation with a nonce set).
 */
ifx_se_status_t ifx_se_aead_verify(
    ifx_se_aead_operation_t *operation,
    ifx_se_fih_ptr_t plaintext,
    ifx_se_fih_t plaintext_size,
    ifx_se_fih_ptr_t plaintext_length,
    const ifx_se_fih_ptr_t tag,
    ifx_se_fih_t tag_length,
    void *ctx);

