PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.h
/** Abort an AEAD operation.
 *
 * Aborting an operation frees all associated resources except for the
 * \p operation structure itself. Once aborted, the operation object
 * can be reused for another operation by calling
 * ifx_se_aead_encrypt_setup() or ifx_se_aead_decrypt_setup() again.
 *
 * You may call this function any time after the operation object has
 * been initialized as described in #ifx_se_aead_operation_t.
 *
 * In particular, calling ifx_se_aead_abort() after the operation has been
 * terminated by a call to ifx_se_aead_abort(), ifx_se_aead_finish() or
 * ifx_se_aead_verify() is safe and has no effect.
 *
 * \param[in,out] operation     Initialized AEAD operation.
 * \param[in] ctx               The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 */
ifx_se_status_t ifx_se_aead_abort(
    ifx_se_aead_operation_t *operation,
    void *ctx);

/** \} */

/** \addtogroup cipher_operations
 * \{
 */

/** Encrypt a message using a symmetric cipher with provided IV.
 *
 * \param[in] key               Identifier of the key to use for the operation.
 *                              It must allow the usage #IFX_SE_KEY_USAGE_ENCRYPT.
 * \param[in] alg               The cipher algorithm to compute
 *                              (\c IFX_SE_ALG_XXX value such that
 *                              #IFX_SE_ALG_IS_CIPHER(\p alg) is true).
 * \param[in] iv                Buffer containing the IV to use.
 * \param[in] iv_length         Size of the IV in bytes.
 * \param[in] input             Buffer containing the message to encrypt.
 * \param[in] input_length      Size of the \p input buffer in bytes.
 * \param[out] output           Buffer where the output is to be written.
 * \param[in] output_size       Size of the \p output buffer in bytes.
 * \param[out] output_length    On success, the number of bytes
 *                              that make up the output.
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \p key is not compatible with \p alg.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 *         \p alg is not supported or is not a cipher algorithm.
 * \retval #IFX_SE_ERROR_BUFFER_TOO_SMALL
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 */
ifx_se_status_t ifx_se_cipher_encrypt(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t iv,
    ifx_se_fih_t iv_length,
    const ifx_se_fih_ptr_t input,
    ifx_se_fih_t input_length,
    ifx_se_fih_ptr_t output,
    ifx_se_fih_t output_size,
    ifx_se_fih_ptr_t output_length,
    void *ctx);

/** Decrypt a message using a symmetric cipher.
 *
 * This function decrypts a message encrypted with a symmetric cipher.
 *
 * \param[in] key               Identifier of the key to use for the operation.
 *                              It must remain valid until the operation
 *                              terminates. It must allow the usage
 *                              #IFX_SE_KEY_USAGE_DECRYPT.
 * \param[in] alg               The cipher algorithm to compute
 *                              (\c IFX_SE_ALG_XXX value such that
 *                              #IFX_SE_ALG_IS_CIPHER(\p alg) is true).
 * \param[in] input             Buffer containing the message to decrypt.
 *                              This consists of the IV followed by the
 *                              ciphertext proper.
 * \param[in] input_length      Size of the \p input buffer in bytes.
 * \param[out] output           Buffer where the plaintext is to be written.
 * \param[in] output_size       Size of the \p output buffer in bytes.
 * \param[out] output_length    On success, the number of bytes
 *                              that make up the output.
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \p key is not compatible with \p alg.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 *         \p alg is not supported or is not a cipher algorithm.
 * \retval #IFX_SE_ERROR_BUFFER_TOO_SMALL
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 */
ifx_se_status_t ifx_se_cipher_decrypt(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t input,
    ifx_se_fih_t input_length,
    ifx_se_fih_ptr_t output,
    ifx_se_fih_t output_size,
    ifx_se_fih_ptr_t output_length,
    void *ctx);

/** Set the key for a multipart symmetric encryption operation.
 *
 * The sequence of operations to encrypt a message with a symmetric cipher
 * is as follows:
 * -# Allocate an operation object which will be passed to all the functions
 *    listed here.
 * -# Initialize the operation object with one of the methods described in the
 *    documentation for #ifx_se_cipher_operation_t, e.g.
 *    #IFX_SE_CIPHER_OPERATION_INIT.
 * -# Call ifx_se_cipher_encrypt_setup() to specify the algorithm and key.
 * -# Call either ifx_se_cipher_generate_iv() or ifx_se_cipher_set_iv() to
 *    generate or set the IV (initialization vector). You should use
 *    ifx_se_cipher_generate_iv() unless the protocol you are implementing
 *    requires a specific IV value.
 * -# Call ifx_se_cipher_update() zero, one or more times, passing a fragment
 *    of the message each time.
 * -# Call ifx_se_cipher_finish().
 *
 * If an error occurs at any step after a call to ifx_se_cipher_encrypt_setup(),
 * the operation will need to be reset by a call to ifx_se_cipher_abort(). The
 * application may call ifx_se_cipher_abort() at any time after the operation
 * has been initialized.
 *
 * After a successful call to ifx_se_cipher_encrypt_setup(), the application must
 * eventually terminate the operation. The following events terminate an
 * operation:
 * - A successful call to ifx_se_cipher_finish().
 * - A call to ifx_se_cipher_abort().
 *
 * \param[in,out] operation     The operation object to set up. It must have
 *                              been initialized as per the documentation for
 *                              #ifx_se_cipher_operation_t and not yet in use.
 * \param[in] key               Identifier of the key to use for the operation.
 *                              It must remain valid until the operation
 *                              terminates. It must allow the usage
 *                              #IFX_SE_KEY_USAGE_ENCRYPT.
 * \param[in] alg               The cipher algorithm to compute
 *                              (\c IFX_SE_ALG_XXX value such that
 *                              #IFX_SE_ALG_IS_CIPHER(\p alg) is true).
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \p key is not compatible with \p alg.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 *         \p alg is not supported or is not a cipher algorithm.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be inactive).
 */
ifx_se_status_t ifx_se_cipher_encrypt_setup(
    ifx_se_cipher_operation_t *operation,
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    void *ctx);

