PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.h
/** \} */


/** \addtogroup import_export
 * \{
 */

/**
 * \brief Destroy a key.
 *
 * This function destroys a key from both volatile
 * memory and, if applicable, non-volatile storage. Implementations shall
 * make a best effort to ensure that that the key material cannot be recovered.
 *
 * This function also erases any metadata such as policies and frees
 * resources associated with the key.
 *
 * If a key is currently in use in a multipart operation, then destroying the
 * key will cause the multipart operation to fail.
 *
 * \param[in] key     Identifier of the key to erase. If this is \c 0,
 *                    do nothing and return #IFX_SE_SUCCESS.
 * \param[in]  ctx    The pointer to the SE syscall context that
 *                    contain a special syscall data
 *                    (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         \p key was a valid identifier and the key material that it
 *         referred to has been erased. Alternatively, \p key is \c 0.
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 *         The key cannot be erased because it is
 *         read-only, either due to a policy or due to physical restrictions.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 *         \p key is not a valid identifier nor \c 0.
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 *         There was an failure in communication with the cryptoprocessor.
 *         The key material may still be present in the cryptoprocessor.
 * \retval #IFX_SE_ERROR_DATA_INVALID
 *         This error is typically a result of either storage corruption on a
 *         cleartext storage backend, or an attempt to read data that was
 *         written by an incompatible version of the library.
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 *         The storage is corrupted. Implementations shall make a best effort
 *         to erase key material even in this stage, however applications
 *         should be aware that it may be impossible to guarantee that the
 *         key material is not recoverable in such cases.
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 *         An unexpected condition which is not a storage corruption or
 *         a communication failure occurred. The cryptoprocessor may have
 *         been compromised.
 */
ifx_se_status_t ifx_se_destroy_key(ifx_se_key_id_fih_t key, void *ctx);


/** Remove non-essential copies of key material from memory.
 *
 * If the key identifier designates a volatile key, this functions does not do
 * anything and returns successfully.
 *
 * If the key identifier designates a persistent key, then this function will
 * free all resources associated with the key in volatile memory. The key
 * data in persistent storage is not affected and the key can still be used.
 *
 * \param[in]  key    Identifier of the key to purge.
 * \param[in]  ctx    The pointer to the SE syscall context that
 *                    contain a special syscall data
 *                    (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         The key material will have been removed from memory if it is not
 *         currently required.
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \p key is not a valid key identifier.
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be inactive).
 */
ifx_se_status_t ifx_se_purge_key(ifx_se_key_id_fih_t key, void *ctx);

/**
 * \brief Generate a key or key pair.
 *
 * The key is generated randomly.
 * Its location, usage policy, type and size are taken from \p attributes.
 *
 * Implementations must reject an attempt to generate a key of size 0.
 *
 * \param[in] attributes    The attributes for the new key.
 * \param[out] key          On success, an identifier for the newly created
 *                          key. For persistent keys, this is the key
 *                          identifier defined in \p attributes.
 *                          \c 0 on failure.
 * \param[in]  ctx          The pointer to the SE syscall context that
 *                          contain a special syscall data
 *                          (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 *         If the key is persistent, the key material and the key's metadata
 *         have been saved to persistent storage.
 * \retval #IFX_SE_ERROR_ALREADY_EXISTS
 *         This is an attempt to create a persistent key, and there is
 *         already a persistent key with the given identifier.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_INSUFFICIENT_ENTROPY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_INSUFFICIENT_STORAGE
 * \retval #IFX_SE_ERROR_DATA_INVALID
 * \retval #IFX_SE_ERROR_DATA_CORRUPT
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 */
ifx_se_status_t ifx_se_generate_key(
    const ifx_se_key_attributes_t *attributes,
    ifx_se_fih_ptr_t key,
    void *ctx);

/** \} */


/** \addtogroup random
 * \{
 */

/**
 * \brief Generate random bytes.
 *
 * \warning This function **can** fail! Callers MUST check the return status
 *          and MUST NOT use the content of the output buffer if the return
 *          status is not #IFX_SE_SUCCESS.
 *
 * \note    To generate a key, use ifx_se_generate_key() instead.
 *
 * \param[out] output           Output buffer for the generated data.
 * \param[in]  output_size      Number of bytes to generate and output.
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \warning The output buffer MUST be larger than output_size by at least
 *          IFX_CRC32_CRC_SIZE (4 bytes) to save the CRC32 value at the end
 *          of the data block
 *
 * \retval #IFX_SE_SUCCESS
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 * \retval #IFX_SE_ERROR_INSUFFICIENT_ENTROPY
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 *
 * \funcusage
 * \snippet main.c snippet_ifx_se_generate_random
 */
ifx_se_status_t ifx_se_generate_random(
    ifx_se_fih_ptr_t output,
    ifx_se_fih_t output_size, /* with CRC included */
    void *ctx);

