PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.h
/** \} */


/** \addtogroup key_derivation
 * \{
 */

/** Abort a key derivation operation.
 *
 * Aborting an operation frees all associated resources except for the \c
 * operation structure itself. Once aborted, the operation object can be reused
 * for another operation by calling ifx_se_key_derivation_setup() again.
 *
 * This function may be called at any time after the operation
 * object has been initialized as described in
 * #ifx_se_key_derivation_operation_t.
 *
 * In particular, it is valid to call ifx_se_key_derivation_abort() twice, or to
 * call ifx_se_key_derivation_abort() on an operation that has not been set up.
 *
 * \param[in,out] operation    The operation to abort.
 * \param[in]  ctx             The pointer to the SE syscall context that
 *                             contain a special syscall data
 *                             (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 */
ifx_se_status_t ifx_se_key_derivation_abort(
    ifx_se_key_derivation_operation_t *operation,
    void *ctx);

/** Set up a key derivation operation.
 *
 * A key derivation algorithm takes some inputs and uses them to generate
 * a byte stream in a deterministic way.
 * This byte stream can be used to produce keys and other
 * cryptographic material.
 *
 * To derive a key:
 * -# Start with an initialized object of type #ifx_se_key_derivation_operation_t.
 * -# Call ifx_se_key_derivation_setup() to select the algorithm.
 * -# Provide the inputs for the key derivation by calling
 *    ifx_se_key_derivation_input_bytes() or ifx_se_key_derivation_input_key()
 *    as appropriate. Which inputs are needed, in what order, and whether
 *    they may be keys and if so of what type depends on the algorithm.
 * -# Optionally set the operation's maximum capacity with
 *    ifx_se_key_derivation_set_capacity(). You may do this before, in the middle
 *    of or after providing inputs. For some algorithms, this step is mandatory
 *    because the output depends on the maximum capacity.
 * -# To derive a key, call ifx_se_key_derivation_output_key().
 *    To derive a byte string for a different purpose, call
 *    ifx_se_key_derivation_output_bytes().
 *    Successive calls to these functions use successive output bytes
 *    calculated by the key derivation algorithm.
 * -# Clean up the key derivation operation object with
 *    ifx_se_key_derivation_abort().
 *
 * If this function returns an error, the key derivation operation object is
 * not changed.
 *
 * If an error occurs at any step after a call to ifx_se_key_derivation_setup(),
 * the operation will need to be reset by a call to ifx_se_key_derivation_abort().
 *
 * Implementations must reject an attempt to derive a key of size 0.
 *
 * \param[in,out] operation       The key derivation operation object
 *                                to set up. It must
 *                                have been initialized but not set up yet.
 * \param[in] alg                 The key derivation algorithm to compute
 *                                (\c IFX_SE_ALG_XXX value such that
 *                                #IFX_SE_ALG_IS_KEY_DERIVATION(\p alg) is true).
 * \param[in]  ctx                The pointer to the SE syscall context that
 *                                contain a special syscall data
 *                                (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \c alg is not a key derivation algorithm.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 *         \c alg is not supported or is not a key derivation algorithm.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be inactive).
 */
ifx_se_status_t ifx_se_key_derivation_setup(
    ifx_se_key_derivation_operation_t *operation,
    ifx_se_alg_fih_t alg,
    void *ctx);

/** Retrieve the current capacity of a key derivation operation.
 *
 * The capacity of a key derivation is the maximum number of bytes that it can
 * return. When you get *N* bytes of output from a key derivation operation,
 * this reduces its capacity by *N*.
 *
 * \param[in]  operation     The operation to query.
 * \param[out] capacity      On success, the capacity of the operation.
 * \param[in]  ctx           The pointer to the SE syscall context that
 *                           contain a special syscall data
 *                           (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be active).
 */
ifx_se_status_t ifx_se_key_derivation_get_capacity(
    const ifx_se_key_derivation_operation_t *operation,
    ifx_se_fih_ptr_t capacity,
    void *ctx);

/** Set the maximum capacity of a key derivation operation.
 *
 * The capacity of a key derivation operation is the maximum number of bytes
 * that the key derivation operation can return from this point onwards.
 *
 * \param[in,out] operation  The key derivation operation object to modify.
 * \param[in] capacity       The new capacity of the operation.
 *                           It must be less or equal to the operation's
 *                           current capacity.
 * \param[in]  ctx           The pointer to the SE syscall context that
 *                           contain a special syscall data
 *                           (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \p capacity is larger than the operation's current capacity.
 *         In this case, the operation object remains valid and its capacity
 *         remains unchanged.
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be active).
 */
ifx_se_status_t ifx_se_key_derivation_set_capacity(
    ifx_se_key_derivation_operation_t *operation,
    ifx_se_fih_t capacity,
    void *ctx);

/** Provide an input for key derivation in the form of a key.
 *
 * Which inputs are required and in what order depends on the algorithm.
 * Refer to the documentation of each key derivation or key agreement
 * algorithm for information.
 *
 * This function obtains input from a key object, which is usually correct for
 * secret inputs or for non-secret personalization strings kept in the key
 * store. To pass a non-secret parameter which is not in the key store,
 * call ifx_se_key_derivation_input_bytes() instead of this function.
 * Refer to the documentation of individual step types
 * (`IFX_SE_KEY_DERIVATION_INPUT_xxx` values of type ::ifx_se_key_derivation_step_t)
 * for more information.
 *
 * If this function returns an error status, the operation enters an error
 * state and must be aborted by calling ifx_se_key_derivation_abort().
 *
 * \param[in,out] operation       The key derivation operation object to use.
 *                                It must have been set up with
 *                                ifx_se_key_derivation_setup() and must not
 *                                have produced any output yet.
 * \param[in] step                Which step the input data is for.
 * \param[in] key                 Identifier of the key. It must have an
 *                                appropriate type for step and must allow the
 *                                usage #IFX_SE_KEY_USAGE_DERIVE or
 *                                #IFX_SE_KEY_USAGE_VERIFY_DERIVATION (see note)
 *                                and the algorithm used by the operation.
 * \param[in]  ctx                The pointer to the SE syscall context that
 *                                contain a special syscall data
 *                                (IPC release callback etc).
 *
 * \note Once all inputs steps are completed, the operations will allow:
 * - ifx_se_key_derivation_output_bytes() if each input was either a direct input
 *   or  a key with #IFX_SE_KEY_USAGE_DERIVE set;
 * - ifx_se_key_derivation_output_key() if the input for step
 *   #IFX_SE_KEY_DERIVATION_INPUT_SECRET or #IFX_SE_KEY_DERIVATION_INPUT_PASSWORD
 *   was from a key slot with #IFX_SE_KEY_USAGE_DERIVE and each other input was
 *   either a direct input or a key with #IFX_SE_KEY_USAGE_DERIVE set;
 * - ifx_se_key_derivation_verify_bytes() if each input was either a direct input
 *   or  a key with #IFX_SE_KEY_USAGE_VERIFY_DERIVATION set;
 * - ifx_se_key_derivation_verify_key() under the same conditions as
 *   ifx_se_key_derivation_verify_bytes().
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 *         The key allows neither #IFX_SE_KEY_USAGE_DERIVE nor
 *         #IFX_SE_KEY_USAGE_VERIFY_DERIVATION, or it doesn't allow this
 *         algorithm.
 *         Also operation rejected with this response when HUK key is selected
 *         in SECURE life cycle and debug port is opened or enabled by policy.
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \c step is not compatible with the operation's algorithm, or
 *         \c step does not allow key inputs of the given type
 *         or does not allow key inputs at all.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid for this input \p step.
 */
ifx_se_status_t ifx_se_key_derivation_input_key(
    ifx_se_key_derivation_operation_t *operation,
    ifx_se_key_derivation_step_t step,
    ifx_se_key_id_fih_t key,
    void *ctx);

