PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.h
/** \} */


/** \addtogroup mac_operations
 * \{
 */

/** Set up a multipart MAC calculation operation.
 *
 * This function sets up the calculation of the MAC
 * (message authentication code) of a byte string.
 * To verify the MAC of a message against an
 * expected value, use ifx_se_mac_verify_setup() instead.
 *
 * The sequence of operations to calculate a MAC is as follows:
 * -# Allocate an operation object which will be passed to all the functions
 *    listed here.
 * -# Initialize the operation object with one of the methods described in the
 *    documentation for #ifx_se_mac_operation_t, e.g. #IFX_SE_MAC_OPERATION_INIT.
 * -# Call ifx_se_mac_sign_setup() to specify the algorithm and key.
 * -# Call ifx_se_mac_update() zero, one or more times, passing a fragment
 *    of the message each time. The MAC that is calculated is the MAC
 *    of the concatenation of these messages in order.
 * -# At the end of the message, call ifx_se_mac_sign_finish() to finish
 *    calculating the MAC value and retrieve it.
 *
 * If an error occurs at any step after a call to ifx_se_mac_sign_setup(), the
 * operation will need to be reset by a call to ifx_se_mac_abort(). The
 * application may call ifx_se_mac_abort() at any time after the operation
 * has been initialized.
 *
 * After a successful call to ifx_se_mac_sign_setup(), the application must
 * eventually terminate the operation through one of the following methods:
 * - A successful call to ifx_se_mac_sign_finish().
 * - A call to ifx_se_mac_abort().
 *
 * \param[in,out] operation The operation object to set up. It must have
 *                          been initialized as per the documentation for
 *                          #ifx_se_mac_operation_t and not yet in use.
 * \param[in] key           Identifier of the key to use for the operation. It
 *                          must remain valid until the operation terminates.
 *                          It must allow the usage IFX_SE_KEY_USAGE_SIGN_MESSAGE.
 * \param[in] alg           The MAC algorithm to compute (\c IFX_SE_ALG_XXX value
 *                          such that #IFX_SE_ALG_IS_MAC(\p alg) is true).
 * \param[in]  ctx          The pointer to the SE syscall context that
 *                          contain a special syscall data
 *                          (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \p key is not compatible with \p alg.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 *         \p alg is not supported or is not a MAC algorithm.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 *         The key could not be retrieved from storage.
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be inactive).
 */
ifx_se_status_t ifx_se_mac_sign_setup(
    ifx_se_mac_operation_t *operation,
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    void *ctx);

/** Set up a multipart MAC verification operation.
 *
 * This function sets up the verification of the MAC
 * (message authentication code) of a byte string against an expected value.
 *
 * The sequence of operations to verify a MAC is as follows:
 * -# Allocate an operation object which will be passed to all the functions
 *    listed here.
 * -# Initialize the operation object with one of the methods described in the
 *    documentation for #ifx_se_mac_operation_t, e.g. #IFX_SE_MAC_OPERATION_INIT.
 * -# Call ifx_se_mac_verify_setup() to specify the algorithm and key.
 * -# Call ifx_se_mac_update() zero, one or more times, passing a fragment
 *    of the message each time. The MAC that is calculated is the MAC
 *    of the concatenation of these messages in order.
 * -# At the end of the message, call ifx_se_mac_verify_finish() to finish
 *    calculating the actual MAC of the message and verify it against
 *    the expected value.
 *
 * If an error occurs at any step after a call to ifx_se_mac_verify_setup(), the
 * operation will need to be reset by a call to ifx_se_mac_abort(). The
 * application may call ifx_se_mac_abort() at any time after the operation
 * has been initialized.
 *
 * After a successful call to ifx_se_mac_verify_setup(), the application must
 * eventually terminate the operation through one of the following methods:
 * - A successful call to ifx_se_mac_verify_finish().
 * - A call to ifx_se_mac_abort().
 *
 * \param[in,out] operation The operation object to set up. It must have
 *                          been initialized as per the documentation for
 *                          #ifx_se_mac_operation_t and not yet in use.
 * \param[in] key           Identifier of the key to use for the operation. It
 *                          must remain valid until the operation terminates.
 *                          It must allow the usage
 *                          IFX_SE_KEY_USAGE_VERIFY_MESSAGE.
 * \param[in] alg           The MAC algorithm to compute (\c IFX_SE_ALG_XXX value
 *                          such that #IFX_SE_ALG_IS_MAC(\p alg) is true).
 * \param[in]  ctx          The pointer to the SE syscall context that
 *                          contain a special syscall data
 *                          (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \c key is not compatible with \c alg.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 *         \c alg is not supported or is not a MAC algorithm.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 *         The key could not be retrieved from storage.
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be inactive).
 */
ifx_se_status_t ifx_se_mac_verify_setup(
    ifx_se_mac_operation_t *operation,
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    void *ctx);

