PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.h
/** Add a message fragment to a multipart MAC operation.
 *
 * The application must call ifx_se_mac_sign_setup() or ifx_se_mac_verify_setup()
 * before calling this function.
 *
 * If this function returns an error status, the operation enters an error
 * state and must be aborted by calling ifx_se_mac_abort().
 *
 * \param[in,out] operation   Active MAC operation.
 * \param[in] input           Buffer containing the message fragment to add to
 *                            the MAC calculation.
 * \param[in] input_length    Size of the \p input buffer in bytes.
 * \param[in]  ctx            The pointer to the SE syscall context that
 *                            contain a special syscall data
 *                            (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be active).
 */
ifx_se_status_t ifx_se_mac_update(
    ifx_se_mac_operation_t *operation,
    const ifx_se_fih_ptr_t input,
    ifx_se_fih_t input_length,
    void *ctx);

/** Finish the calculation of the MAC of a message.
 *
 * The application must call ifx_se_mac_sign_setup() before calling this function.
 * This function calculates the MAC of the message formed by concatenating
 * the inputs passed to preceding calls to ifx_se_mac_update().
 *
 * When this function returns successfully, the operation becomes inactive.
 * If this function returns an error status, the operation enters an error
 * state and must be aborted by calling ifx_se_mac_abort().
 *
 * \warning Applications should not call this function if they expect
 *          a specific value for the MAC. Call ifx_se_mac_verify_finish() instead.
 *          Beware that comparing integrity or authenticity data such as
 *          MAC values with a function such as \c memcmp is risky
 *          because the time taken by the comparison may leak information
 *          about the MAC value which could allow an attacker to guess
 *          a valid MAC and thereby bypass security controls.
 *
 * \param[in,out] operation Active MAC operation.
 * \param[out] mac          Buffer where the MAC value is to be written.
 * \param[in]  mac_size     Size of the \p mac buffer in bytes.
 * \param[out] mac_length   On success, the number of bytes
 *                          that make up the MAC value. This is always
 *                          #IFX_SE_MAC_LENGTH(\c key_type, \c key_bits, \c alg)
 *                          where \c key_type and \c key_bits are the type and
 *                          bit-size respectively of the key and \c alg is the
 *                          MAC algorithm that is calculated.
 * \param[in]  ctx          The pointer to the SE syscall context that
 *                          contain a special syscall data
 *                          (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_BUFFER_TOO_SMALL
 *         The size of the \p mac buffer is too small. You can determine a
 *         sufficient buffer size by calling IFX_SE_MAC_LENGTH().
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be an active mac sign
 *         operation).
 */
ifx_se_status_t ifx_se_mac_sign_finish(
    ifx_se_mac_operation_t *operation,
    ifx_se_fih_ptr_t mac,
    ifx_se_fih_t mac_size,
    ifx_se_fih_ptr_t mac_length,
    void *ctx);

/** Finish the calculation of the MAC of a message and compare it with
 * an expected value.
 *
 * The application must call ifx_se_mac_verify_setup() before calling this function.
 * This function calculates the MAC of the message formed by concatenating
 * the inputs passed to preceding calls to ifx_se_mac_update(). It then
 * compares the calculated MAC with the expected MAC passed as a
 * parameter to this function.
 *
 * When this function returns successfully, the operation becomes inactive.
 * If this function returns an error status, the operation enters an error
 * state and must be aborted by calling ifx_se_mac_abort().
 *
 * \note Implementations shall make the best effort to ensure that the
 * comparison between the actual MAC and the expected MAC is performed
 * in constant time.
 *
 * \param[in,out] operation    Active MAC operation.
 * \param[in] mac              Buffer containing the expected MAC value.
 * \param[in] mac_length       Size of the \p mac buffer in bytes.
 * \param[in] ctx              The pointer to the SE syscall context that
 *                             contain a special syscall data
 *                             (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         The expected MAC is identical to the actual MAC of the message.
 * \retval #IFX_SE_ERROR_INVALID_SIGNATURE
 *         The MAC of the message was calculated successfully, but it
 *         differs from the expected MAC.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The operation state is not valid (it must be an active mac verify
 *         operation).
 */
ifx_se_status_t ifx_se_mac_verify_finish(
    ifx_se_mac_operation_t *operation,
    const ifx_se_fih_ptr_t mac,
    ifx_se_fih_t mac_length,
    void *ctx);

/** Abort a MAC operation.
 *
 * Aborting an operation frees all associated resources except for the
 * \p operation structure itself. Once aborted, the operation object
 * can be reused for another operation by calling
 * ifx_se_mac_sign_setup() or ifx_se_mac_verify_setup() again.
 *
 * You may call this function any time after the operation object has
 * been initialized by one of the methods described in #ifx_se_mac_operation_t.
 *
 * In particular, calling ifx_se_mac_abort() after the operation has been
 * terminated by a call to ifx_se_mac_abort(), ifx_se_mac_sign_finish() or
 * ifx_se_mac_verify_finish() is safe and has no effect.
 *
 * \param[in,out] operation     Initialized MAC operation.
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 */
ifx_se_status_t ifx_se_mac_abort(
    ifx_se_mac_operation_t *operation,
    void *ctx);

/** Calculate the MAC (message authentication code) of a message.
 *
 * \note To verify the MAC of a message against an
 *       expected value, use ifx_se_mac_verify() instead.
 *       Beware that comparing integrity or authenticity data such as
 *       MAC values with a function such as \c memcmp is risky
 *       because the time taken by the comparison may leak information
 *       about the MAC value which could allow an attacker to guess
 *       a valid MAC and thereby bypass security controls.
 *
 * \param[in] key           Identifier of the key to use for the operation. It
 *                          must allow the usage IFX_SE_KEY_USAGE_SIGN_MESSAGE.
 * \param[in] alg           The MAC algorithm to compute (\c IFX_SE_ALG_XXX
 *                          value such that #IFX_SE_ALG_IS_MAC(\p alg) is true).
 * \param[in] input         Buffer containing the input message.
 * \param[in] input_length  Size of the \p input buffer in bytes.
 * \param[out] mac          Buffer where the MAC value is to be written.
 * \param[in]  mac_size     Size of the \p mac buffer in bytes.
 * \param[out] mac_length   On success, the number of bytes
 *                          that make up the MAC value.
 * \param[in]  ctx          The pointer to the SE syscall context that
 *                          contain a special syscall data
 *                          (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         Success.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \p key is not compatible with \p alg.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 *         \p alg is not supported or is not a MAC algorithm.
 * \retval #IFX_SE_ERROR_BUFFER_TOO_SMALL
 *         \p mac_size is too small
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 *         The key could not be retrieved from storage.
 */
ifx_se_status_t ifx_se_mac_compute(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t input,
    ifx_se_fih_t input_length,
    ifx_se_fih_ptr_t mac,
    ifx_se_fih_t mac_size,
    ifx_se_fih_ptr_t mac_length,
    void *ctx);

