PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto.h
/** Calculate the MAC of a message and compare it with a reference value.
 *
 * \param[in] key           Identifier of the key to use for the operation. It
 *                          must allow the usage IFX_SE_KEY_USAGE_VERIFY_MESSAGE.
 * \param[in] alg           The MAC algorithm to compute (\c IFX_SE_ALG_XXX
 *                          value such that #IFX_SE_ALG_IS_MAC(\p alg) is true).
 * \param[in] input         Buffer containing the input message.
 * \param[in] input_length  Size of the \p input buffer in bytes.
 * \param[out] mac          Buffer containing the expected MAC value.
 * \param[in]  mac_length   Size of the \p mac buffer in bytes.
 * \param[in]  ctx          The pointer to the SE syscall context that
 *                          contain a special syscall data
 *                          (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 *         The expected MAC is identical to the actual MAC of the input.
 * \retval #IFX_SE_ERROR_INVALID_SIGNATURE
 *         The MAC of the message was calculated successfully, but it
 *         differs from the expected value.
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_NOT_PERMITTED
 * \retval #IFX_SE_ERROR_INVALID_ARGUMENT
 *         \p key is not compatible with \p alg.
 * \retval #IFX_SE_ERROR_NOT_SUPPORTED
 *         \p alg is not supported or is not a MAC algorithm.
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_HARDWARE_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 *         The key could not be retrieved from storage.
 */
ifx_se_status_t ifx_se_mac_verify(
    ifx_se_key_id_fih_t key,
    ifx_se_alg_fih_t alg,
    const ifx_se_fih_ptr_t input,
    ifx_se_fih_t input_length,
    const ifx_se_fih_ptr_t mac,
    ifx_se_fih_t mac_length,
    void *ctx);

/** \} */

/** \addtogroup key_attributes
 * \{
 */

/** Reset a key attribute structure to a freshly initialized state.
 *
 * You must initialize the attribute structure as described in the
 * documentation of the type #ifx_se_key_attributes_t before calling this
 * function. Once the structure has been initialized, you may call this
 * function at any time.
 *
 * This function frees any auxiliary resources that the structure
 * may contain.
 *
 * \param[in,out] attributes    The attribute structure to reset.
 */
void ifx_se_reset_key_attributes(ifx_se_key_attributes_t *attributes);

/** Retrieve the attributes of a key.
 *
 * This function first resets the attribute structure as with
 * ifx_se_reset_key_attributes(). It then copies the attributes of
 * the given key into the given attribute structure.
 *
 * \note This function may allocate memory or other resources.
 *       Once you have called this function on an attribute structure,
 *       you must call ifx_se_reset_key_attributes() to free these resources.
 *
 * \param[in] key               Identifier of the key to query.
 * \param[in,out] attributes    On success, the attributes of the key.
 *                              On failure, equivalent to a
 *                              freshly-initialized structure.
 * \param[in]  ctx              The pointer to the SE syscall context that
 *                              contain a special syscall data
 *                              (IPC release callback etc).
 *
 * \retval #IFX_SE_SUCCESS
 * \retval #IFX_SE_ERROR_INVALID_HANDLE
 * \retval #IFX_SE_ERROR_INSUFFICIENT_MEMORY
 * \retval #IFX_SE_ERROR_COMMUNICATION_FAILURE
 * \retval #IFX_SE_ERROR_CORRUPTION_DETECTED
 * \retval #IFX_SE_ERROR_STORAGE_FAILURE
 * \retval #IFX_SE_ERROR_DATA_CORRUPT
 * \retval #IFX_SE_ERROR_DATA_INVALID
 * \retval #IFX_SE_ERROR_BAD_STATE
 *         The library has not been previously initialized by ifx_se_crypto_init().
 *         It is implementation-dependent whether a failure to initialize
 *         results in this error code.
 */
ifx_se_status_t ifx_se_get_key_attributes(ifx_se_key_id_fih_t key,
        ifx_se_key_attributes_t *attributes,
        void *ctx);

/** \} */

/* BWC macros for obsoleted API, don't use it in the applications */
#define ifx_se_key_derivation_inp_key       ifx_se_key_derivation_input_key
#define ifx_se_key_derivation_inp_bytes     ifx_se_key_derivation_input_bytes
#define ifx_se_key_derivation_out_key       ifx_se_key_derivation_output_key
#define ifx_se_key_derivation_out_bytes     ifx_se_key_derivation_output_bytes

#ifdef __cplusplus
}
#endif

#endif /* IFX_SE_PSACRYPTO_H */
